; <Firechip™ IDE: Is a free (GNU) source code editor for electronics designer.>
; Copyright © 2012 "Alexander Salas" <alexander@firechip.info>

 ; This program is free software: you can redistribute it and/or modify
 ; it under the terms of the GNU General Public License as published by 
 ; the Free Software Foundation, either version 3 of the License, or
 ; any later version.

 ; This program is distributed in the hope that it will be useful,
 ; but WITHOUT ANY WARRANTY; without even the implied warranty of
 ; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 ; GNU General Public License for more details.

 ; You should have received a copy of the GNU General Public License
 ; along with this program. If not, see <http://www.gnu.org/licenses/>.
[HexEditor.dll NppMenu]
Main="&Hex-Editor"
0="&HEX-Mode"
1="&Vergleiche HEX"
2="Lösche &Resultate"
4="&Spalten einfügen..."
5="&Pattern ersetzen..."
7="&Optionen..."
8="&Hilfe..."

[HexEditor.dll SettingsMenu]
0="Ausschneiden"
1="Kopieren"
2="Einfügen"
3="Löschen"
5="Zeige in"
7="Adressbreite..."
8="Spalten..."

[HexEditor.dll FindReplace]
1="Weitersuchen"
2="Schließen"
20403="Groß-/&Klein beachten"
20404="Wrap aroun&d"
20405="Rück&wärts"
20406="&Vorwärts"
20407="&Ersetzen"
20408="&Zählen"
20409="&Alle ersetzen"
20411="Transparenz"
20412="Open"
20413="Mitte"
20414="Unten"
20415="In &Markierung"
20416="Ersetzen durch:"
20418="Suchen nach:"
20419="&Datentyp:"
20420="Suchrichtung"
20421="Display Position"

[HexEditor.dll Options]
Caption="Hex-Editor Optionen"
2="Abbruch"
20201="8-Bit"
20202="16-Bit"
20203="32-Bit"
20204="64-Bit"
20205="Little-Endian"
20206="Big-Endian"
20207="Binär"
20208="Hexadezimal"
20209="Spaltenzahl:"
20210="Adressbreite:"
20212="Großbuchstaben"
20214="Erweiternungen:%t%t             z.B.: .dat .exe"
20216="HEX-Modus bei X%% erkannter NULL-en"
20218="Schriftart:"
20220="Schriftgröße:"
20222="Fett"
20223="Kursiv"
20224="Unterstrichen"
20225="Text"
20226="Hintergrund"
20227="Reguärer Text:"
20230="Selektion:"
20233="Differenz:"
20236="Lesezeichen:"
20238="Cursorspiegel als Rechteck"
20239="Current Line:"
  
[HexEditor.dll Pattern]
2="Abbruch"
20501="Hex-Pattern:"
20502="Anzahl:"
20503="An Position:"

[HexEditor.dll ColumnCount]
Caption="Spaltenzahl"

[HexEditor.dll AddressWidth]
Caption="Adressbreite"

[HexEditor.dll ColorPopup]
1="Mehr Farben..."

[HexEditor.dll CompDialog]
Caption="Hex-Editor Vergleich"
20751="Die Layouteinstellungen sind unterschiedlich.%nSollen die linken oder die rechten Einstellungen für beide gesetzt werden?"
20752="Die Layouteinstellungen sind unterschiedlich.%nSollen die oberen oder die unteren Einstellungen für beide gesetzt werden?"
20753="Rechten"
20754="Linken"
20755="Unteren"
20756="Oberen"

[HexEditor.dll Goto]
Caption="Gehe zu..."
1="&Gehe zu..."
2="Abbrechen"
20304="...zur Zeile"
20305="Sie sind hier:"
20306="Hier hingehen:"
20307="Es geht nicht weiter als:"
20308="Adresse"
20309="Offset"

[HexEditor.dll Help]
Caption="Hilfe"
20603="Entwickler:"
20604="eMail:"
20605="Ich danke Don für diesen großartigen Editor und seiner Hilfe%nbei der Erstellung dieses Plugins. Außerdem danke ich%nVitaliy und Richard Mant für Ihre Unterstützung."
20606="Menüelemente"
20607="Hex-Mode%t%tSchaltet zwischen Hex und ANSI um."
20608="Vergleiche HEX%t%tVergleicht Dateien und markiert die%n%t%t%tUnterschiede."
20609="Lösche Resultate%tLöscht die markierten Unterschiede."
20610="Spalten einfügen...%tErmöglicht Spalten mit einem%n%t%t%tspezifischen Pattern einzufügen."
20611="Pattern ersetzen...%tErsetzt einen Block durch ein Pattern."
20612="Optionen...%t%tErmöglicht hier individuelle%n%t%t%tEinstellungen des Hex-Editors."
20613="Hilfe...%t%t%tZeigt diesen Hilfe-Dialog an."

[HexEditor.dll Text]
Find="Suchen"
Replace="Ersetzen"
Count="Zählen"
to Hex="Hex"
to Binary="Binär"
to BigEndian="Big-Endian"
to LittleEndian="Little-Endian"
Pattern Replace="Pattern ersetzen"
Insert Columns="Spalten einfügen"
Start Layout="Start Layout"
Startup="Autostart"
Colors="Farben"
Font="Schrift"
Tokens Found="%%i Elemente gefunden."
Tokens Replaced="%%i Elemente ersetzt.%n"
Tokens Skipped="%%s%%i Elemente wegen Alignment-Fehler übersprungen.%n"
Pos Between="Ausschließlich Spaltenposition von 0 bis %%d möglich."
CantFind="Text nicht gefunden."
MsgBox PatNotSet="Pattern ist nicht gesetzt!%tHex-Editor"
MsgBox MaxColCnt="Maximal 128 Bytes können in einer Zeile dargestellt werden.%tHex-Editor"
MsgBox SelectSomething="Bitte Text selektieren!%tHex-Editor"
MsgBox OddDigits="Unterschiedliche Ziffernanzahl erkannt. Die Daten werden geküzt!%tHex-Editor"
MsgBox MaxAddCnt="Nur Adressbreiten zwischen 4 und 16 möglich.%tHex-Editor"
MsgBox CompDelete="Vergleichsresultate werden gelöscht! Fortsetzen?%tHex-Editor Vergleich"
MsgBox CompMatch="Dateien sind identisch.%tHex-Editor Vergleich"
MsgBox ReplError="Die Variablen können im Little-Endian-Mode nur Spaltenweise%nersetzt werden. Z.B. im 16-Bit-Mode kann die Suchenlänge 2 und die%nErsetzenlänge 8 oder umgekehrt betragen.%tHex-Editor Error"
MsgBox DelError="Die Variablen können im Little-Endian-Mode nur Spaltenweise gelöscht werden.%tHex-Editor Error"
MsgBox SameWidth="Inhalt des Clipboards besitzt nicht die gleiche Informationsbreite!%tHex-Editor Error"